task: detect  # Fixes the guessing warning
nc: 80
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, GhostConv, [128, 3, 2]]
  - [-1, 3, SGC2f, [128]]
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [-1, 6, SGC2f, [256]]
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [-1, 6, SGC2f, [512]]
  - [-1, 1, GhostConv, [1024, 3, 2]]
  - [-1, 3, SGC2f, [1024]]
  - [-1, 1, EMA, [1024]]
  - [-1, 1, SPPF, [1024, 5]]

head:  # <-- CHANGED FROM 'neck:' TO 'head:'
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, SGC2f, [512]]
  - [-1, 1, ECA, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, SGC2f, [256]]
  - [-1, 1, ECA, [256]]

  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, SGC2f, [512]]
  - [-1, 1, ECA, [512]]

  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, SGC2f, [1024]]
  - [-1, 1, ECA, [1024]]

  - [[18, 22, 26], 1, Detect, [nc]]